In [2]:
import numpy as np
import pandas as pd

Series : A one-dimensional labeled array holding data of any type
DataFrame: A two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns

In [4]:
s= pd.Series([1,3,5,np.nan,6,9])

In [5]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.746573 -0.226456  0.343500  0.200404
2013-01-02  0.669021  1.061450  0.023892  0.439659
2013-01-03 -0.271656 -0.130584 -0.764649  2.133813
2013-01-04 -1.273898  0.129294 -0.791949 -1.596293
2013-01-05  1.851458  1.470712  1.473361 -2.021964
2013-01-06  0.026271  0.580174  0.507064 -1.428999

In [14]:
df2 = pd.DataFrame(
    {
        "A":5.00,
        "B":pd.Timestamp("20130102"), 
        "C":pd.Series(1,index=list(range(4)), dtype = "float32"),
        "D":np.array([3]*4, dtype="int32"),
        "E":pd.Categorical(["test","train","test","train"]),
        "F":"Hi"
    }
)
df2

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [16]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [17]:
df2.head()

     A          B    C  D      E   F
0  5.0 2013-01-02  1.0  3   test  Hi
1  5.0 2013-01-02  1.0  3  train  Hi
2  5.0 2013-01-02  1.0  3   test  Hi
3  5.0 2013-01-02  1.0  3  train  Hi

In [19]:
df.tail(2)

                   A         B         C         D
2013-01-05  1.851458  1.470712  1.473361 -2.021964
2013-01-06  0.026271  0.580174  0.507064 -1.428999

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.to_numpy()

array([[ 0.74657304, -0.22645562,  0.34350048,  0.2004044 ],
       [ 0.66902066,  1.06145001,  0.02389171,  0.43965855],
       [-0.27165611, -0.13058371, -0.7646488 ,  2.13381329],
       [-1.2738978 ,  0.1292936 , -0.79194863, -1.59629307],
       [ 1.85145772,  1.47071193,  1.47336138, -2.02196445],
       [ 0.02627066,  0.58017382,  0.50706358, -1.42899864]])

In [22]:
df2.to_numpy()

array([[5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'Hi'],
       [5.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'Hi']],
      dtype=object)

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.746573    0.669021   -0.271656   -1.273898    1.851458    0.026271
B   -0.226456    1.061450   -0.130584    0.129294    1.470712    0.580174
C    0.343500    0.023892   -0.764649   -0.791949    1.473361    0.507064
D    0.200404    0.439659    2.133813   -1.596293   -2.021964   -1.428999

In [26]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01  0.746573 -0.226456  0.343500  0.200404
2013-01-03 -0.271656 -0.130584 -0.764649  2.133813
2013-01-04 -1.273898  0.129294 -0.791949 -1.596293
2013-01-06  0.026271  0.580174  0.507064 -1.428999
2013-01-02  0.669021  1.061450  0.023892  0.439659
2013-01-05  1.851458  1.470712  1.473361 -2.021964